## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.firewall_rules.azurerm_firewall_policy.aks will be updated in-place
  ~ resource "azurerm_firewall_policy" "aks" {
        id                                = "/subscriptions/1c7e8402-ac8b-48d9-a8c8-f3de95064482/resourceGroups/aztf-hub-rg/providers/Microsoft.Network/firewallPolicies/aks-fwp"
        name                              = "aks-fwp"
      ~ tags                              = {
          - "Environment" = "Dev" -> null
          - "Owner"       = "kmiszel" -> null
          - "Source"      = "Terraform" -> null
        }
        # (10 unchanged attributes hidden)
    }

  # module.windows_vm.azurerm_network_interface.compute will be created
  + resource "azurerm_network_interface" "compute" {
      + applied_dns_servers         = (known after apply)
      + id                          = (known after apply)
      + internal_domain_name_suffix = (known after apply)
      + location                    = "northeurope"
      + mac_address                 = (known after apply)
      + name                        = "winhost-nic"
      + private_ip_address          = (known after apply)
      + private_ip_addresses        = (known after apply)
      + resource_group_name         = "aztf-hub-rg"
      + tags                        = {
          + "Environment" = "Dev"
          + "Owner"       = "kmiszel"
          + "Source"      = "Terraform"
        }
      + virtual_machine_id          = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "internal"
          + primary                                            = (known after apply)
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = "IPv4"
          + subnet_id                                          = "/subscriptions/1c7e8402-ac8b-48d9-a8c8-f3de95064482/resourceGroups/aztf-hub-rg/providers/Microsoft.Network/virtualNetworks/aztf-hub-vnet/subnets/DevSubnet"
        }
    }

  # module.windows_vm.azurerm_windows_virtual_machine.compute will be created
  + resource "azurerm_windows_virtual_machine" "compute" {
      + admin_password                                         = (sensitive value)
      + admin_username                                         = "kmiszel"
      + allow_extension_operations                             = true
      + bypass_platform_safety_checks_on_user_schedule_enabled = false
      + computer_name                                          = (known after apply)
      + disk_controller_type                                   = (known after apply)
      + enable_automatic_updates                               = true
      + extensions_time_budget                                 = "PT1H30M"
      + hotpatching_enabled                                    = false
      + id                                                     = (known after apply)
      + location                                               = "northeurope"
      + max_bid_price                                          = -1
      + name                                                   = "winhost"
      + network_interface_ids                                  = (known after apply)
      + patch_assessment_mode                                  = "ImageDefault"
      + patch_mode                                             = "AutomaticByOS"
      + platform_fault_domain                                  = -1
      + priority                                               = "Regular"
      + private_ip_address                                     = (known after apply)
      + private_ip_addresses                                   = (known after apply)
      + provision_vm_agent                                     = true
      + public_ip_address                                      = (known after apply)
      + public_ip_addresses                                    = (known after apply)
      + resource_group_name                                    = "aztf-hub-rg"
      + size                                                   = "Standard_D2s_v3"
      + tags                                                   = {
          + "Environment" = "Dev"
          + "Owner"       = "kmiszel"
          + "Source"      = "Terraform"
        }
      + virtual_machine_id                                     = (known after apply)
      + vm_agent_platform_updates_enabled                      = false

      + boot_diagnostics {}

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + name                      = (known after apply)
          + storage_account_type      = "Standard_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "WindowsServer"
          + publisher = "MicrosoftWindowsServer"
          + sku       = "2019-Datacenter"
          + version   = "latest"
        }

      + termination_notification (known after apply)
    }

Plan: 2 to add, 1 to change, 0 to destroy.
```
</details>